Infineon/mtb-example-psoc-edge-otw-update/proj_cm33_ns/dfu_user.c
/*******************************************************************************
 * \file dfu_user.c
 * \version 6.1.100
 *
 * This file provides the custom API for a firmware application with
 * DFU SDK.
 * - Cy_DFU_ReadData (address, length, ctl, params) - to read  the NVM block
 * - Cy_Bootalod_WriteData(address, length, ctl, params) - to write the NVM block
 *
 ********************************************************************************
 * \copyright
 * (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation. All rights reserved.
 ********************************************************************************
 * This software, including source code, documentation and related materials
 * ("Software") is owned by Cypress Semiconductor Corporation or one of its
 * affiliates ("Cypress") and is protected by and subject to worldwide patent
 * protection (United States and foreign), United States copyright laws and
 * international treaty provisions. Therefore, you may use this Software only
 * as provided in the license agreement accompanying the software package from
 * which you obtained this Software ("EULA").
 *
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software source
 * code solely for use in connection with Cypress's integrated circuit products.
 * Any reproduction, modification, translation, compilation, or representation
 * of this Software except as specified above is prohibited without the express
 * written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer of such
 * system or application assumes all risk of such use and in doing so agrees to
 * indemnify Cypress against all liability.
 *******************************************************************************/

#include <string.h>
#include "cy_syslib.h"
#include "cy_dfu.h"
#include "cy_dfu_logging.h"
#include "mtb_hal_system.h"

#if (CY_DFU_OPT_EXTERNAL_MEMORY == 0U)
    #include "mtb_hal_nvm.h"
#endif /* #if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */

#ifdef COMPONENT_DFU_I2C
    #include "transport_i2c.h"
#endif /* COMPONENT_DFU_I2C */

#ifdef COMPONENT_DFU_UART
    #include "transport_uart.h"
#endif /* COMPONENT_DFU_UART */

#ifdef COMPONENT_DFU_SPI
    #include "transport_spi.h"
#endif /* COMPONENT_DFU_SPI*/

#ifdef COMPONENT_DFU_USB_CDC
    #include "transport_usb_cdc.h"
#endif /* COMPONENT_DFU_USB_CDC */

#ifdef COMPONENT_DFU_EMUSB_CDC
    #include "transport_emusb_cdc.h"
#endif /* COMPONENT_DFU_EMUSB_CDC */

#ifdef COMPONENT_DFU_EMUSB_HID
    #include "transport_emusb_hid.h"
#endif /* COMPONENT_DFU_EMUSB_HID */

#ifdef COMPONENT_DFU_CANFD
    #include "transport_canfd.h"
#endif /* COMPONENT_DFU_CANFD */

#if !defined(COMPONENT_DFU_I2C) && !defined(COMPONENT_DFU_UART) && !defined(COMPONENT_DFU_SPI) &&                \
    !defined(COMPONENT_DFU_USB_CDC) && !defined(COMPONENT_DFU_EMUSB_CDC) && !defined(COMPONENT_DFU_EMUSB_HID) && \
    !defined(COMPONENT_DFU_CANFD)
    #warning "Select at least one of the DFU transports."
#endif /* !defined(COMPONENT_DFU_I2C) ... !defined(COMPONENT_DFU_CANFD) */

#if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
    #ifndef CY_EXT_NVM0_BASE
        #define CY_EXT_NVM0_BASE CY_XIP_PORT0_BASE
        #define CY_EXT_NVM0_SIZE CY_XIP_PORT0_SIZE
    #endif /* CY_EXT_NVM0_BASE */
    #ifndef CY_EXT_NVM1_BASE
        #define CY_EXT_NVM1_BASE CY_XIP_PORT1_BASE
        #define CY_EXT_NVM1_SIZE CY_XIP_PORT1_SIZE
    #endif /* CY_EXT_NVM1_BASE */
#endif /* CY_DFU_OPT_EXTERNAL_MEMORY != 0U */

#define SECURE_REGION_MASK (0x10000000u)
/* Global NVM object */
#if (CY_DFU_OPT_EXTERNAL_MEMORY == 0U)
    #if !defined CY_IP_MXS40SSRSS || !defined COMPONENT_NON_SECURE_DEVICE
        static mtb_hal_nvm_t nvm_obj;
    #endif /* !defined CY_IP_MXS40SSRSS || !defined COMPONENT_NON_SECURE_DEVICE */
#endif /* (CY_DFU_OPT_EXTERNAL_MEMORY == 0U) */

#if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
static mtb_serial_memory_t *serialMemObjPtr = NULL;

void Cy_DFU_AddExtMemory(mtb_serial_memory_t *serialMemObj)
{
    serialMemObjPtr = serialMemObj;
}
#endif /* #if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */

    static cy_en_dfu_transport_t selectedInterface = CY_DFU_UART;

#ifdef CY_IP_M7CPUSS
    static const mtb_hal_nvm_region_info_t *blocks_info;
    static uint8_t blocks_count;
    static uint32_t blocks_sector_size;
#endif

#if CY_DFU_FLOW == CY_DFU_BASIC_FLOW
/*
* The DFU SDK metadata initial value is placed here
* Note: the number of elements equal to the number of the app multiplies by 2
*       because of the two fields per app plus one element for the CRC-32C field.
*/
CY_SECTION(".cy_boot_metadata") __USED
static const uint32_t cy_dfu_metadata[CY_FLASH_SIZEOF_ROW / sizeof(uint32_t)] =
{
    CY_DFU_APP0_VERIFY_START, CY_DFU_APP0_VERIFY_LENGTH, /* The App0 base address and length */
    CY_DFU_APP1_VERIFY_START, CY_DFU_APP1_VERIFY_LENGTH, /* The App1 base address and length */
    0U                                                   /* The rest does not matter     */
};
#endif /*CY_DFU_FLOW == CY_DFU_BASIC_FLOW*/

static bool IsMultipleOf(uint32_t value, uint32_t multiple);
static bool AddressValid(uint32_t address, cy_stc_dfu_params_t *params);

#if CY_DFU_FLOW == CY_DFU_BASIC_FLOW
static void GetStartEndAddress(uint32_t appId, uint32_t *startAddress, uint32_t *endAddress);
#endif /* CY_DFU_FLOW == CY_DFU_BASIC_FLOW */

#if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
static cy_en_dfu_status_t Ext_Flash_WriteRow(uint32_t address, size_t length, cy_stc_dfu_params_t *params);
static cy_en_dfu_status_t Ext_Flash_ReadRow(uint32_t address, size_t length, uint8_t *data);
#endif /* (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */

