Infineon/mtb-example-psoc-edge-otw-update/proj_cm33_ns/dfu_user.c
/*******************************************************************************
 * Function Name: IsMultipleOf
 *******************************************************************************
 *
 * This internal function check if value parameter is a multiple of parameter
 * multiple
 *
 * \param value      value that will be checked
 * \param multiple   value with which value is checked
 *
 * \return True - value is multiple of parameter multiple, else False
 *
 *******************************************************************************/
static bool IsMultipleOf(uint32_t value, uint32_t multiple)
{
    return ((value % multiple) == 0U);
}

/*******************************************************************************
 * Function Name: AddressValid
 *******************************************************************************
 *
 * Internal function to validate address
 *
 * \param address    The address to check.
 * \param params     The pointer to a DFU parameters structure, see \ref cy_stc_dfu_params_t.
 *
 * \return True - address valid
 *
 *******************************************************************************/
static bool AddressValid(uint32_t address, cy_stc_dfu_params_t *params)
{
    bool addrValid = true;

#if CY_DFU_FLOW == CY_DFU_BASIC_FLOW
    addrValid = ((((CY_FLASH_BASE + CY_DFU_APP0_VERIFY_LENGTH)) <= address) &&
                 (address < (CY_FLASH_BASE + CY_FLASH_SIZE))) ||
                ((CY_EM_EEPROM_BASE <= address) &&
                 (address < (CY_EM_EEPROM_BASE + CY_EM_EEPROM_SIZE)));
    CY_UNUSED_PARAMETER(params);
#else /* MCUBoot flow*/
    #if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) /* External memory */
        addrValid = ((CY_EXT_NVM0_BASE <= address) && (address < (CY_EXT_NVM0_BASE + CY_EXT_NVM0_SIZE))) ||
                    ((CY_EXT_NVM1_BASE <= address) && (address < (CY_EXT_NVM1_BASE + CY_EXT_NVM1_SIZE)));
        CY_UNUSED_PARAMETER(params);
    #else                                  /* Internal memory */
        #ifdef CY_IP_M7CPUSS
            blocks_sector_size = 0U;
            for (uint32_t block_num = 0U; block_num < blocks_count; block_num++)
            {
                uint32_t flash_start_address = (&blocks_info[block_num])->start_address;
                uint32_t flash_size = (&blocks_info[block_num])->size;
                if ((flash_start_address <= address) && (address < flash_start_address + flash_size))
                {
                    blocks_sector_size = (&blocks_info[0])->sector_size;
                    break;
                }
            }
            addrValid = (blocks_sector_size > 0U);
        #else
            #if defined CY_FLASH_BASE
                addrValid = (CY_FLASH_BASE <= address) && (address < (CY_FLASH_BASE + CY_FLASH_SIZE));
            #else
                CY_DFU_LOG_WRN("Address validation skipped");
                CY_UNUSED_PARAMETER(address);
            #endif /* defined CY_FLASH_BASE */
            CY_UNUSED_PARAMETER(params);
        #endif /* CY_IP_M7CPUSS */
    #endif /* (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */
#endif /* CY_DFU_FLOW == CY_DFU_BASIC_FLOW */

    return addrValid;
}

#if CY_DFU_FLOW == CY_DFU_BASIC_FLOW
/*******************************************************************************
 * Function Name: GetStartEndAddress
 *******************************************************************************
 *
 * This internal function returns start and end address of application
 *
 * \param appId          The application number
 * \param startAddress   The pointer to a variable where an application start
 *                       address is stored
 * \param endAddress     The pointer to a variable where a size of application
 *                       area is stored.
 *
 *******************************************************************************/
static void GetStartEndAddress(uint32_t appId, uint32_t *startAddress, uint32_t *endAddress)
{
    uint32_t verifyStart;
    uint32_t verifySize;

    (void)Cy_DFU_GetAppMetadata(appId, &verifyStart, &verifySize);

#if (CY_DFU_APP_FORMAT == CY_DFU_SIMPLIFIED_APP)
    *startAddress = verifyStart - CY_DFU_SIGNATURE_SIZE;
    *endAddress = verifyStart + verifySize;
#else
    *startAddress = verifyStart;
    *endAddress = verifyStart + verifySize + CY_DFU_SIGNATURE_SIZE;
#endif
}
#endif /* CY_DFU_FLOW == CY_DFU_BASIC_FLOW */

#if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
/*******************************************************************************
 * Function Name: Ext_Flash_WriteRow
 *******************************************************************************
 *
 * This internal function which combines erase and write phases forstoring data in external memory.
 *
 * \param address    The address in the QSPI flash where data must be stored.
 * \param length     The size of the stored data.
 * \param params     The pointer to a DFU parameters structure, see \ref cy_stc_dfu_params_t
 *
 * \return See \ref cy_en_dfu_status_t.
 *
 *******************************************************************************/
static cy_en_dfu_status_t Ext_Flash_WriteRow(uint32_t address, size_t length, cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_SUCCESS;

    size_t progBlockSize;
    size_t eraseBlockSize;
    size_t eraseBlockStart;
    static size_t lastErasedBlockStart = 0;
    static size_t lastErasedBlockEnd = 0;
    uint32_t extmemAddress = ((address) - (CY_EXT_NVM0_BASE));

    CY_DFU_LOG_DBG("Ext_Flash_WriteRow: address[%p] extmemAddress[%p] length[%u]",
                   (void *)address, (void *)extmemAddress, length);

    if (serialMemObjPtr == NULL)
    {
        status = CY_DFU_ERROR_READ_EXT;
        CY_DFU_LOG_ERR("Ext_Flash_WriteRow: External memory not added");
    }
    else
    {
        /* Erase command */
        if (length == 0U)
        {
            eraseBlockSize = mtb_serial_memory_get_erase_size(serialMemObjPtr, extmemAddress);

            /* The address is expected to be valid and aligned with external memory
             * Erase command rules.
             */
            cy_rslt_t extstatus = mtb_serial_memory_erase(serialMemObjPtr, extmemAddress, eraseBlockSize);
            status = (extstatus == CY_RSLT_SUCCESS) ? CY_DFU_SUCCESS : CY_DFU_ERROR_WRITE_EXT;
        }
        else /* Write command */
        {
        #ifndef CY_DFU_DISABLE_EXTMEM_ERASE
            /* Check and erase the memory */
            if ((lastErasedBlockStart <= extmemAddress) && ((extmemAddress + length) <= lastErasedBlockEnd))
            {
                /* Required memory is already erased */
                CY_DFU_LOG_DBG("Ext_Flash_WriteRow: Memory is already erased");
            }
            else
            {
                eraseBlockStart = mtb_serial_memory_get_sector_start_address(serialMemObjPtr, extmemAddress);

