Infineon/mtb-example-psoc-edge-otw-update/proj_cm33_ns/dfu_user.c
                /* The size of memory to erase:
                 * the last sector address - the first sector address + the last sector size */
                eraseBlockSize = (size_t)mtb_serial_memory_get_sector_start_address(serialMemObjPtr, extmemAddress + (length - 1U)) -
                                 extmemAddress + mtb_serial_memory_get_erase_size(serialMemObjPtr, extmemAddress + (length - 1U));

                CY_DFU_LOG_DBG("Ext_Flash_WriteRow: Erase Operation - eraseBlockStart[%p] eraseBlockSize[%u]",
                               (void *)eraseBlockStart, eraseBlockSize);

                cy_rslt_t extstatus = mtb_serial_memory_erase(serialMemObjPtr, eraseBlockStart, eraseBlockSize);
                if ((unsigned int)extstatus == CY_RSLT_SUCCESS)
                {
                    status = CY_DFU_SUCCESS;
                    /* Remember details of the block erased */
                    lastErasedBlockStart = eraseBlockStart;
                    lastErasedBlockEnd = eraseBlockStart + eraseBlockSize;
                }
                else
                {
                    status = CY_DFU_ERROR_WRITE_EXT;
                    CY_DFU_LOG_ERR("Ext_Flash_WriteRow: Erase failed[%u] - address[%p] eraseBlockStart[%p] eraseBlockSize[%u]",
                                   (unsigned int)extstatus, (void *)address, (void *)eraseBlockStart, eraseBlockSize);
                }
            }
        #endif /* !define CY_DFU_DISABLE_EXTMEM_ERASE */

            /* Check size of program block */
            if (status == CY_DFU_SUCCESS)
            {
                progBlockSize = mtb_serial_memory_get_prog_size(serialMemObjPtr, extmemAddress);
                if ((IsMultipleOf(length, progBlockSize) == 0))
                {
                    status = CY_DFU_ERROR_LENGTH;
                    CY_DFU_LOG_ERR("Ext_Flash_WriteRow: Invalid Program size");
                }
            }

            if (status == CY_DFU_SUCCESS)
            {
                cy_rslt_t extstatus = mtb_serial_memory_write(serialMemObjPtr, extmemAddress, length, params->dataBuffer);
                if ((unsigned int)extstatus == CY_RSLT_SUCCESS)
                {
                    status = CY_DFU_SUCCESS;
                }
                else
                {
                    status = CY_DFU_ERROR_WRITE_EXT;
                    CY_DFU_LOG_ERR("Ext_Flash_WriteRow: Write failed[%u] - address[%p] length[%u]",
                                   (unsigned int)extstatus, (void *)address, length);
                }
            }
        }
    }

    return status;
}

/*******************************************************************************
 * Function Name: Ext_Flash_ReadRow
 *******************************************************************************
 *
 * This internal function reads data from external memory.
 *
 * \param address    The address in the serial memory from which data must be read.
 * \param length     The size of the requested data.
 * \param data       The pointer to the data buffer.
 *
 *******************************************************************************/
static cy_en_dfu_status_t Ext_Flash_ReadRow(uint32_t address, size_t length, uint8_t *data)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_READ_EXT;
    uint32_t extmemAddress = address - CY_EXT_NVM0_BASE;

    if (serialMemObjPtr == NULL)
    {
        status = CY_DFU_ERROR_READ_EXT;
    }
    else
    {
        cy_rslt_t extstatus = mtb_serial_memory_read(serialMemObjPtr, extmemAddress, length, data);
        if ((unsigned int)extstatus == CY_RSLT_SUCCESS)
        {
            status = CY_DFU_SUCCESS;
        }
        else
        {
            status = CY_DFU_ERROR_READ_EXT;
            CY_DFU_LOG_ERR("Ext_Flash_ReadRow: Read failed[%u] - address[%p] length[%u]",
                           (unsigned int)extstatus, (void *)address, length);
        }
    }

    return status;
}
#endif /* (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */

/*******************************************************************************
 * Function Name: Cy_DFU_WriteData
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
cy_en_dfu_status_t Cy_DFU_WriteData(uint32_t address, uint32_t length, uint32_t ctl,
                                    cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_SUCCESS;

    /* Check if the address is inside the valid range */
    address &= ~(SECURE_REGION_MASK);
    if (!AddressValid(address, params))
    {
        status = CY_DFU_ERROR_ADDRESS;
    }

    /* Check if the length is valid
     * Note Length = 0 is valid for erase command */
    if ((IsMultipleOf(address, CY_NVM_SIZEOF_ROW) == false) ||
        ((length != CY_NVM_SIZEOF_ROW) && ((ctl & CY_DFU_IOCTL_ERASE) == 0U)))
    {
        status = CY_DFU_ERROR_LENGTH;
    }

#if CY_DFU_FLOW == CY_DFU_BASIC_FLOW
    uint32_t app = Cy_DFU_GetRunningApp();
    uint32_t startAddress;
    uint32_t endAddress;

    GetStartEndAddress(app, &startAddress, &endAddress);

    /* Refuse to write to a row within a range of the current application */
    if ((startAddress <= address) && (address < endAddress))
    { /* It is forbidden to overwrite the currently running application */
        status = CY_DFU_ERROR_ADDRESS;
    }

    #if CY_DFU_OPT_GOLDEN_IMAGE
        if (status == CY_DFU_SUCCESS)
        {
            uint8_t goldenImages[] = {CY_DFU_GOLDEN_IMAGE_IDS()};
            uint32_t count = sizeof(goldenImages) / sizeof(goldenImages[0]);
            uint32_t idx;
            for (idx = 0U; idx < count; ++idx)
            {
                app = goldenImages[idx];
                GetStartEndAddress(app, &startAddress, &endAddress);

                if ((startAddress <= address) && (address < endAddress))
                {
                    status = Cy_DFU_ValidateApp(app, params);
                    status = (status == CY_DFU_SUCCESS) ? CY_DFU_ERROR_ADDRESS : CY_DFU_SUCCESS;
                    break;
                }
            }
        }
    #endif /* #if CY_DFU_OPT_GOLDEN_IMAGE != 0 */
#endif /*CY_DFU_FLOW == CY_DFU_BASIC_FLOW*/

    if (status == CY_DFU_SUCCESS)
    {
        if ((ctl & CY_DFU_IOCTL_ERASE) != 0U)
        {
            (void)memset(params->dataBuffer, 0, CY_NVM_SIZEOF_ROW);
        }

    #if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
        status = Ext_Flash_WriteRow(address, length, params);
    #else /* Internal flash */
        cy_rslt_t fstatus = CY_RSLT_SUCCESS;

