Infineon/mtb-example-psoc-edge-otw-update/proj_cm33_ns/dfu_user.c
        #ifdef CY_IP_M7CPUSS
            uint32_t int_status;
            int_status = mtb_hal_system_critical_section_enter();
            if (address % blocks_sector_size == 0U)
            {
                fstatus = mtb_hal_nvm_erase(&nvm_obj, address);
            }
            if (fstatus == CY_RSLT_SUCCESS)
            {
                fstatus = mtb_hal_nvm_program(&nvm_obj, address, (uint32_t *)params->dataBuffer);
                if (fstatus != CY_RSLT_SUCCESS)
                {
                    status = CY_DFU_ERROR_DATA;
                    CY_DFU_LOG_ERR("NVM program failed: module=0x%X code=0x%X",
                                (unsigned int)CY_RSLT_GET_MODULE(fstatus),
                                (unsigned int)CY_RSLT_GET_CODE(fstatus));
                }
            }
            else
            {
                status = CY_DFU_ERROR_DATA;
                CY_DFU_LOG_ERR("NVM erase failed: module=0x%X code=0x%X",
                            (unsigned int)CY_RSLT_GET_MODULE(fstatus),
                            (unsigned int)CY_RSLT_GET_CODE(fstatus));
            }
            mtb_hal_system_critical_section_exit(int_status);
        #else
            #if defined CY_IP_MXS40SSRSS && defined COMPONENT_NON_SECURE_DEVICE
                #error "Add custom non-secure application NVM erase and NVM write calls"
            #else
                uint32_t int_status = mtb_hal_system_critical_section_enter();
                CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.3', 'Casting uint8_t* to uint32_t* is safe as input address is always valid and aligned.');
                fstatus = mtb_hal_nvm_write(&nvm_obj, address, (uint32_t *)params->dataBuffer);
                mtb_hal_system_critical_section_exit(int_status);
                if (fstatus != CY_RSLT_SUCCESS)
                {
                    status = CY_DFU_ERROR_DATA;
                    CY_DFU_LOG_ERR("NVM write failed: fstatus 0x%X ", (unsigned int)fstatus);
                }
            #endif /* defined CY_IP_MXS40SSRSS && defined COMPONENT_NON_SECURE_DEVICE */
        #endif /* CY_IP_M7CPUSS */
    #endif /* (CY_DFU_OPT_EXTERNAL_MEMORY != 0) */
    }

    if (CY_DFU_SUCCESS != status)
    {
        CY_DFU_LOG_ERR("Write operation failed at address 0x%X", (unsigned int)address);
    }

    return (status);
}

/*******************************************************************************
 * Function Name: Cy_DFU_ReadData
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
cy_en_dfu_status_t Cy_DFU_ReadData(uint32_t address, uint32_t length, uint32_t ctl,
                                   cy_stc_dfu_params_t *params)
{
    cy_en_dfu_status_t status = CY_DFU_SUCCESS;

    /* Check if the length is valid */
    if (IsMultipleOf(length, CY_NVM_SIZEOF_ROW) == false)
    {
        status = CY_DFU_ERROR_LENGTH;
    }

    /* Check if the address is inside the valid range */
    address &= ~(SECURE_REGION_MASK);
    if (!AddressValid(address, params))
    {
        status = CY_DFU_ERROR_ADDRESS;
    }

    /* Read or Compare */
    if (status == CY_DFU_SUCCESS)
    {
        if ((ctl & CY_DFU_IOCTL_COMPARE) == 0U)
        {
        #if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
            status = Ext_Flash_ReadRow(address, length, params->dataBuffer);
        #elif defined CY_IP_MXS40SSRSS && defined COMPONENT_NON_SECURE_DEVICE
            (void)memcpy(params->dataBuffer, (const void *)address, (size_t)length);
            status = CY_DFU_SUCCESS;
        #else
            cy_rslt_t fstatus = mtb_hal_nvm_read(&nvm_obj, address, params->dataBuffer, length);
            status = (fstatus == CY_RSLT_SUCCESS) ? CY_DFU_SUCCESS : CY_DFU_ERROR_DATA;
        #endif /* (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */
        }
        else
        {
        #if (CY_DFU_OPT_EXTERNAL_MEMORY != 0U)
            uint8_t dataBuffer[CY_DFU_SIZEOF_DATA_BUFFER];
            status = Ext_Flash_ReadRow(address, length, dataBuffer);

            if (status == CY_DFU_SUCCESS)
            {
                status = (memcmp(params->dataBuffer, dataBuffer, length) == 0)
                             ? CY_DFU_SUCCESS
                             : CY_DFU_ERROR_VERIFY;
            }
        #else
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 11.6', 'The cast from unsigned int to the pointer does not have any unintended effect, as the casted value represents the memory address');
            status = (memcmp((const void *)params->dataBuffer, (const void *)address, length) == 0)
                         ? CY_DFU_SUCCESS
                         : CY_DFU_ERROR_VERIFY;
        #endif /* (CY_DFU_OPT_EXTERNAL_MEMORY != 0U) */
        }
    }
    return (status);
}

/*******************************************************************************
 * Function Name: Cy_DFU_TransportStart
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
void Cy_DFU_TransportStart(cy_en_dfu_transport_t transport)
{
    selectedInterface = transport;

#if (CY_DFU_OPT_EXTERNAL_MEMORY == 0U)
    /* Initialize NVM object */
    #if defined CY_IP_MXS40SSRSS && defined COMPONENT_NON_SECURE_DEVICE
        #error "Add custom non-secure application NVM initialization call"
    #endif /* defined CY_IP_MXS40SSRSS && defined COMPONENT_NON_SECURE_DEVICE */
#endif /* (CY_DFU_OPT_EXTERNAL_MEMORY == 0U) */

#ifdef CY_IP_M7CPUSS
    mtb_hal_nvm_info_t nvm_info;
    /* Enable code flash write function */
    Cy_Flashc_MainWriteEnable();

    /* Get NVM characteristics */
    ntb_hal_nvm_get_info(&nvm_obj, &nvm_info);
    blocks_info = nvm_info.regions;
    blocks_count = nvm_info.region_count;
#endif

    switch (transport)
    {
    #ifdef COMPONENT_DFU_I2C
        case CY_DFU_I2C:
            I2C_I2cCyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_I2C */

