Infineon/mtb-example-psoc-edge-otw-update/proj_cm33_ns/dfu_user.c
    #ifdef COMPONENT_DFU_UART
        case CY_DFU_UART:
            UART_UartCyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_UART */
    #ifdef COMPONENT_DFU_SPI
        case CY_DFU_SPI:
            SPI_SpiCyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_SPI */
    #ifdef COMPONENT_DFU_USB_CDC
        case CY_DFU_USB_CDC:
            USB_CDC_CyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_USB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_CDC
        case CY_DFU_USB_CDC:
            USB_CDC_CyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_EMUSB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_HID
        case CY_DFU_USB_HID:
            USB_HID_CyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_EMUSB_HID */
    #ifdef COMPONENT_DFU_CANFD
        case CY_DFU_CANFD:
            CANFD_CanfdCyBtldrCommStart();
            break;
    #endif /* COMPONENT_DFU_CANFD */

        default:
            /* Selected interface in not applicable */
            CY_ASSERT(false);
            break;
    }
}

/*******************************************************************************
 * Function Name: Cy_DFU_TransportStop
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
void Cy_DFU_TransportStop(void)
{
    switch (selectedInterface)
    {
    #ifdef COMPONENT_DFU_I2C
        case CY_DFU_I2C:
            I2C_I2cCyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_I2C */

    #ifdef COMPONENT_DFU_UART
        case CY_DFU_UART:
            UART_UartCyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_UART */
    #ifdef COMPONENT_DFU_SPI
        case CY_DFU_SPI:
            SPI_SpiCyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_SPI */
    #ifdef COMPONENT_DFU_USB_CDC
        case CY_DFU_USB_CDC:
            USB_CDC_CyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_USB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_CDC
        case CY_DFU_USB_CDC:
            USB_CDC_CyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_EMUSB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_HID
        case CY_DFU_USB_HID:
            USB_HID_CyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_EMUSB_HID */
    #ifdef COMPONENT_DFU_CANFD
        case CY_DFU_CANFD:
            CANFD_CanfdCyBtldrCommStop();
            break;
    #endif /* COMPONENT_DFU_CANFD */

        default:
            /* Selected interface in not applicable */
            CY_ASSERT(false);
            break;
    }
}

/*******************************************************************************
 * Function Name: Cy_DFU_TransportReset
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
void Cy_DFU_TransportReset(void)
{
    switch (selectedInterface)
    {
    #ifdef COMPONENT_DFU_I2C
        case CY_DFU_I2C:
            I2C_I2cCyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_I2C */

    #ifdef COMPONENT_DFU_UART
        case CY_DFU_UART:
            UART_UartCyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_UART */
    #ifdef COMPONENT_DFU_SPI
        case CY_DFU_SPI:
            SPI_SpiCyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_SPI */
    #ifdef COMPONENT_DFU_USB_CDC
        case CY_DFU_USB_CDC:
            USB_CDC_CyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_USB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_CDC
        case CY_DFU_USB_CDC:
            USB_CDC_CyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_EMUSB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_HID
        case CY_DFU_USB_HID:
            USB_HID_CyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_EMUSB_HID */
    #ifdef COMPONENT_DFU_CANFD
        case CY_DFU_CANFD:
            CANFD_CanfdCyBtldrCommReset();
            break;
    #endif /* COMPONENT_DFU_CANFD */

        default:
            /* Selected interface in not applicable */
            CY_ASSERT(false);
            break;
    }
}

/*******************************************************************************
 * Function Name: Cy_DFU_TransportRead
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
cy_en_dfu_status_t Cy_DFU_TransportRead(uint8_t buffer[], uint32_t size, uint32_t *count, uint32_t timeout)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_UNKNOWN;

    switch (selectedInterface)
    {
    #ifdef COMPONENT_DFU_I2C
        case CY_DFU_I2C:
            status = I2C_I2cCyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_I2C */

    #ifdef COMPONENT_DFU_UART
        case CY_DFU_UART:
            status = UART_UartCyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_UART */
    #ifdef COMPONENT_DFU_SPI
        case CY_DFU_SPI:
            status = SPI_SpiCyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_SPI */
    #ifdef COMPONENT_DFU_USB_CDC
        case CY_DFU_USB_CDC:
            status = USB_CDC_CyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_USB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_CDC
        case CY_DFU_USB_CDC:
            status = USB_CDC_CyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_EMUSB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_HID
        case CY_DFU_USB_HID:
            status = USB_HID_CyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_EMUSB_HID */
    #ifdef COMPONENT_DFU_CANFD
        case CY_DFU_CANFD:
            status = CANFD_CanfdCyBtldrCommRead(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_CANFD */

        default:
            /* Selected interface in not applicable */
            CY_ASSERT(false);
            break;
    }

