Infineon/mtb-example-psoc-edge-otw-update/proj_cm33_ns/dfu_user.c
    return status;
}

/*******************************************************************************
 * Function Name: Cy_DFU_TransportWrite
 *******************************************************************************
 *
 * This function documentation is part of the DFU SDK API, see the
 * cy_dfu.h file or DFU SDK API Reference Manual for details.
 *
 *******************************************************************************/
cy_en_dfu_status_t Cy_DFU_TransportWrite(uint8_t buffer[], uint32_t size, uint32_t *count, uint32_t timeout)
{
    cy_en_dfu_status_t status = CY_DFU_ERROR_UNKNOWN;

    switch (selectedInterface)
    {
    #ifdef COMPONENT_DFU_I2C
        case CY_DFU_I2C:
            status = I2C_I2cCyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_I2C */

    #ifdef COMPONENT_DFU_UART
        case CY_DFU_UART:
            status = UART_UartCyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_UART */
    #ifdef COMPONENT_DFU_SPI
        case CY_DFU_SPI:
            status = SPI_SpiCyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_SPI */
    #ifdef COMPONENT_DFU_USB_CDC
        case CY_DFU_USB_CDC:
            status = USB_CDC_CyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_USB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_CDC
        case CY_DFU_USB_CDC:
            status = USB_CDC_CyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_EMUSB_CDC */
    #ifdef COMPONENT_DFU_EMUSB_HID
        case CY_DFU_USB_HID:
            status = USB_HID_CyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_EMUSB_HID */
    #ifdef COMPONENT_DFU_CANFD
        case CY_DFU_CANFD:
            status = CANFD_CanfdCyBtldrCommWrite(buffer, size, count, timeout);
            break;
    #endif /* COMPONENT_DFU_CANFD */

        default:
            /* Selected interface in not applicable */
            CY_ASSERT(false);
            break;
    }

    return status;
}

/* [] END OF FILE */
